transform-smooks/src/test/resources/xml/soap-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <orders:submitOrder xmlns:orders="urn:switchyard-quickstart:transform-smooks:1.0">
         <order>
            <orderId>PO-19838-XYZ</orderId>
            <itemId>BUTTER</itemId>
            <quantity>200</quantity>
         </order>
      </orders:submitOrder>
   </soapenv:Body>
</soapenv:Envelope>
